Repository: gheordi/votegrouping
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ro

source: authentication error
ro: eroare de autentificare

source: Design your Community
ro: Creati propria comunitate

source: your Votes
ro: votul dvs

source: Notifications
ro: Notificari

source: Your possible groups
ro: Grupurile dvs posibile

source: Add argument
ro: Adauga argument

source: Please Wait...
ro: Asteptati...

source: Request was sent to the server.
ro: Cererea a fost trimisa catre server

source: Add Solution
ro: Adauga Solutie

source: Title:
ro: Titlu:

source: Description:
ro: Descriere:

source: Photo Url:
ro: Url imagine:

source: Proposition
ro: Propunere

source: Against
ro: Impotriva

source: Your Vote:
ro: Votul dvs:

source: Forbide
ro: Interzic

source: Tolerate
ro: Tolerez

source: Agree
ro: De acord

source: Mandatory for me
ro: Obligatoriu pentru mine

source: Mandatory for everyone
ro: Obligatoriu pentru toti

source: Product
ro: Produs

source: maybe
ro: poate

source: I'd try
ro: As incerca

source: rarely
ro: rar

source: often
ro: des

source: daily
ro: zilnic

source: I'd produce
ro: As produce

source: Users
ro: Useri

source: rather not
ro: nu prea

source: like
ro: imi place

source: mandatory
ro: obligatoriu

source: Password
ro: Parola

source: Forgot password
ro: Am uitat parola

source: invalid username/password
ro: user/parola invalida

source: Name
ro: Nume

source: Photo Url
ro: Url Imagine

source: User succesfully registered.
ro: User inregistrat cu succes

source: Recover Password
ro: Recupereaza Parola

source: Input your email address
ro: Introduceti adresa de email

source: Email was sent. Please check and log in
ro: Email trimis. Va rugam verificati si log in

source: Add Topic
ro: Adauga Categorie

source: Vote different social projects and join the others like you in a political group
ro: Votati pentru diverse proiecte sociale. Astfel va veti regasi intr-un grup politic cu cei cu opinii similare
